app/views/posts/show.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `posts_tags` ON `tags`.`id` = `posts_tags`.`tag_id` WHERE `posts_tags`.`post_id` = 9
---
      <p>
      <% @post.tags.each{|tag|%>

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1
---
    <div class = 'comments'>
      <% @post.comments.each do |comment| %>