app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Adding first comment', 1, 2, '2017-02-25 13:14:15', '2017-02-25 13:14:15')
---
	def create
		@comment = Comment.new(comment_params)
    @comment.user_id = current_user.id if current_user
    if @comment.save