app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def show
  	@post = Post.find(params[:id]) if params[:id]

SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = 'tag1' LIMIT 1
---
  def tag_posts
    @posts = []
    if params[:tag]
      tag = Tag.find_by name: params[:tag]

INSERT INTO `posts` (`title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('First Title', 'First Descriptions', 2, '2017-02-25 07:00:59', '2017-02-25 07:00:59')
INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES ('tag1', '2017-02-27 15:12:07', '2017-02-27 15:12:07')
---
  def create
    @post = Post.new(post_params)
    tags = create_tags
    @post.user_id = current_user.id if current_user
    tags.each{|tag| @post.tags.push(tag)}

UPDATE `posts` SET `description` = 'First Descriptions edited', `updated_at` = '2017-02-25 07:01:14' WHERE `posts`.`id` = 1
---
  def update
  	@post.user_id = current_user.id if current_user
    if @post.update(post_params)

DELETE FROM `posts` WHERE `posts`.`id` = 2
---
  def destroy
  	if @post
      @post.destroy

SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2 AND `posts`.`id` = 2 LIMIT 1
---
    def set_post
    	unless current_user
    	  redirect_to posts_path
    	else
    		@post = current_user.posts.find(params[:id]) if params[:id]